src/cf/InformationRegisters/BackupHistoryOfBuiltInBinaryDataStorage.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>BackupHistoryOfBuiltInBinaryDataStorage</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>BackupFileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>TypeOfBackup</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TypesOfBackupsOfBuiltInBinaryDataStorage</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/BackupHistoryOfBuiltInBinaryDataStorage/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal
Procedure AddRecord(TypeOfBackup, CreationDate, BackupFileName) Export

	Set = CreateRecordSet();
	Set.Filter.TypeOfBackup.Set(TypeOfBackup);
	Set.Filter.CreationDate.Set(CreationDate);

	Record = Set.Add();
	Record.TypeOfBackup		= TypeOfBackup;
	Record.CreationDate				= CreationDate;
	Record.BackupFileName	= BackupFileName;

	Set.Write();

EndProcedure
#EndRegion

#EndIf
